music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "5a35PCxQxPhisM4wrryvzw"], ["updated_at", "2020-03-03 19:29:13.065935"], ["id", 1]]
---
    def create
        @user = User.create(user_params)

        if @user.save